/**
 * 城市管理局 的处置中和已闭环options内容
 */
const cityManageOptions = {
  czz: [
    {
      label: '经组织会商，应急管理部暂不启动防汛应急响应',
      value: '经组织会商，应急管理部暂不启动防汛应急响应'
    },
    {
      label: '经组织会商，应急管理部拟启动IV级防汛应急响应',
      value: '经组织会商，应急管理部拟启动IV级防汛应急响应'
    },
    {
      label: '经组织会商，应急管理部拟启动Ⅲ级防汛应急响应',
      value: '经组织会商，应急管理部拟启动Ⅲ级防汛应急响应'
    },
    {
      label: '经组织会商，应急管理部拟启动Ⅱ级防汛应急响应',
      value: '经组织会商，应急管理部拟启动Ⅱ级防汛应急响应'
    },
    {
      label: '经组织会商，应急管理部拟启动Ⅰ级防汛应急响应',
      value: '经组织会商，应急管理部拟启动Ⅰ级防汛应急响应'
    }
  ],
  ybh: [
    {
      label: '经防汛处置，已解除洪涝风险',
      value: '经防汛处置，已解除洪涝风险'
    },
    {
      label: '经防汛处置，拟解除IV级防汛应急响应',
      value: '经防汛处置，拟解除IV级防汛应急响应'
    },
    {
      label: '经防汛处置，拟解除Ⅲ级防汛应急响应',
      value: '经防汛处置，拟解除Ⅲ级防汛应急响应'
    },
    {
      label: '经防汛处置，拟解除Ⅱ级防汛应急响应',
      value: '经防汛处置，拟解除Ⅱ级防汛应急响应'
    },
    {
      label: '经防汛处置，拟解除Ⅰ级防汛应急响应',
      value: '经防汛处置，拟解除Ⅰ级防汛应急响应'
    }
  ]
};

export { cityManageOptions };
